{
    "levels": [
      {
        "level_name": "Intermediate",
        "persian_level_name": "متوسط",
        "lessons": [
          {
            "lesson_number": 33,
            "lesson_name": "LESSON 33",
            "persian_lesson_name": "درس 33",
            "idioms": [
              {
                "english_phrase": "to kick (something) around",
                "persian_phrase_meaning": "به طور غیررسمی بحث کردن (در طی یک دوره زمانی)",
                "english_definition": "to discuss informally (over a period of time)",
                "persian_definition_meaning": "بحث کردن به صورت غیررسمی (در طول یک دوره زمانی)",
                "english_explanation": "(also: to toss around)",
                "persian_explanation_meaning": "(همچنین: به toss around)",
                "examples": [
                  {
                    "english_text": "At first my friends were reluctant to consider my suggestion, but they finally were willing to kick it around for a while.",
                    "persian_meaning": "در ابتدا دوستانم تمایلی به بررسی پیشنهاد من نداشتند، اما بالاخره حاضر شدند مدتی در مورد آن بحث کنند."
                  },
                  {
                    "english_text": "Herb thought that we should kick around the idea of establishing a special fund for supporting needy members of the club.",
                    "persian_meaning": "هربی فکر می‌کرد که باید ایده ایجاد یک صندوق ویژه برای حمایت از اعضای نیازمند باشگاه را بررسی کنیم."
                  }
                ]
              },
              {
                "english_phrase": "on the ball",
                "persian_phrase_meaning": "هوشیار، باصلاحیت، گوش‌به‌زنگ",
                "english_definition": "attentive, competent, alert",
                "persian_definition_meaning": "با دقت، شایسته، گوش‌به‌زنگ",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Jim was the only one who caught that serious error in the bookkeeping statements. He's really on the ball.",
                    "persian_meaning": "جیم تنها کسی بود که آن خطای جدی را در صورت‌های حسابداری گرفت. او واقعاً هوشیار است."
                  },
                  {
                    "english_text": "Ella was certainly on the ball when she remembered to reconfirm our flight arrangements. All the rest of us would have forgotten.",
                    "persian_meaning": "الا قطعاً با دقت بود که به یاد آورد برنامه‌های پروازمان را دوباره تأیید کند. بقیه ما فراموش می‌کردیم."
                  }
                ]
              },
              {
                "english_phrase": "to make up",
                "persian_phrase_meaning": "جبران کردن؛ خلق کردن؛ آرایش کردن؛ تشکیل دادن",
                "english_definition": "to meet or fulfill a missed obligation at a later time (S); to create, to invent (an idea) (S); to apply cosmetics to (S); to comprise, to be composed of",
                "persian_definition_meaning": "تکمیل یا انجام دادن یک تعهد از دست رفته در زمان بعدی؛ خلق کردن، اختراع کردن (یک ایده)؛ آرایش کردن؛ تشکیل دادن، شامل بودن",
                "english_explanation": "Note that all of the definitions are separable except the last one.",
                "persian_explanation_meaning": "توجه داشته باشید که همه تعاریف به جز آخرین مورد قابل تفکیک هستند.",
                "examples": [
                  {
                    "english_text": "The teacher allowed several students who missed the exam to make it up during the next class.",
                    "persian_meaning": "معلم به چندین دانش‌آموز که امتحان را از دست داده بودند اجازه داد آن را در کلاس بعدی جبران کنند."
                  },
                  {
                    "english_text": "The little boy made up a bad excuse for wearing his dirty shoes in the house, so his mother punished him.",
                    "persian_meaning": "پسر کوچک بهانه‌ای بد برای پوشیدن کفش‌های کثیفش در خانه ساخت، بنابراین مادرش او را تنبیه کرد."
                  },
                  {
                    "english_text": "Dee was able to make her face up in half the normal time because she didn't use much makeup.",
                    "persian_meaning": "دی توانست صورتش را در نیمی از زمان معمول آرایش کند زیرا از آرایش زیادی استفاده نمی‌کرد."
                  },
                  {
                    "english_text": "Two separate bodies --- the House of Representatives and the Senate --- make up the Congress of the United States.",
                    "persian_meaning": "دو نهاد جداگانه --- مجلس نمایندگان و سنا --- کنگره ایالات متحده را تشکیل می‌دهند."
                  }
                ]
              },
              {
                "english_phrase": "to make up with",
                "persian_phrase_meaning": "اختلافات را حل کردن",
                "english_definition": "resolve differences with",
                "persian_definition_meaning": "اختلافات را با کسی حل و فصل کردن",
                "english_explanation": "This idiom is used for differences of opinion between friends and lovers.",
                "persian_explanation_meaning": "این اصطلاح برای اختلافات نظر بین دوستان و عاشقان استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "Gundula made up with her roommate after their serious misunderstanding about arrangements for the party.",
                    "persian_meaning": "گوندولا پس از سوءتفاهم جدی خود با هم‌اتاقی‌اش در مورد ترتیب برگزاری مهمانی، با او آشتی کرد."
                  },
                  {
                    "english_text": "After the bad quarrel the two lovers kissed and made up with each other.",
                    "persian_meaning": "پس از دعوای بد، دو عاشق یکدیگر را بوسیدند و آشتی کردند."
                  }
                ]
              },
              {
                "english_phrase": "to pull together",
                "persian_phrase_meaning": "جمع‌آوری کردن؛ کنترل احساسات را به دست آوردن",
                "english_definition": "to gather, to collect (information) (S); to gain control of one's emotions (S)",
                "persian_definition_meaning": "جمع‌آوری کردن، گردآوری (اطلاعات)؛ کنترل احساسات خود را به دست آوردن",
                "english_explanation": "A reflexive pronoun must be used for the second definition.",
                "persian_explanation_meaning": "برای تعریف دوم باید از ضمیر انعکاسی استفاده شود."
                ,
                "examples": [
                  {
                    "english_text": "The reporter pulled together information from several sources in preparing the newspaper article.",
                    "persian_meaning": "خبرنگار برای تهیه مقاله روزنامه، اطلاعاتی را از چندین منبع جمع‌آوری کرد."
                  },
                  {
                    "english_text": "Mr. Simpson was so frightened when he heard footsteps behind him on the lonely, dark street that it took several minutes to pull himself together.",
                    "persian_meaning": "آقای سیمپسون آنقدر ترسیده بود وقتی صدای پا را پشت سرش در خیابان تاریک و خلوت شنید که چند دقیقه طول کشید تا خودش را جمع‌وجور کند."
                  }
                ]
              },
              {
                "english_phrase": "to be looking up",
                "persian_phrase_meaning": "امیدوارکننده به نظر رسیدن، بهبود یافتن",
                "english_definition": "to appear promising or optimistic, to be improving",
                "persian_definition_meaning": "امیدوارکننده یا خوش‌بینانه به نظر رسیدن، در حال بهبود بودن",
                "english_explanation": "This idiom is used in a continuous tense, very often with the subject things.",
                "persian_explanation_meaning": "این اصطلاح در زمان استمراری و اغلب با فاعل 'things' استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "The board chairman is glad to report that things are looking up for the company after several years of declining sales.",
                    "persian_meaning": "رئیس هیئت مدیره خوشحال است که گزارش دهد پس از چندین سال کاهش فروش، وضعیت شرکت رو به بهبود است."
                  },
                  {
                    "english_text": "Prospects for building that new library in the downtown area are looking up.",
                    "persian_meaning": "چشم‌انداز ساخت آن کتابخانه جدید در مرکز شهر رو به بهبود است."
                  }
                ]
              },
              {
                "english_phrase": "to kick the habit",
                "persian_phrase_meaning": "ترک یک عادت بد",
                "english_definition": "to stop a bad habit",
                "persian_definition_meaning": "یک عادت بد را ترک کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Once a child becomes accustomed to chewing his nails, it's difficult to kick the habit.",
                    "persian_meaning": "وقتی یک کودک به جویدن ناخن‌هایش عادت می‌کند، ترک این عادت دشوار است."
                  },
                  {
                    "english_text": "The doctor advised the heavy cigarette smoker that her heart had become damaged and that she should kick the habit right away.",
                    "persian_meaning": "پزشک به سیگاری قهار توصیه کرد که قلبش آسیب دیده و باید فوراً این عادت را ترک کند."
                  }
                ]
              },
              {
                "english_phrase": "to cover up",
                "persian_phrase_meaning": "پنهان کردن، مخفی کردن",
                "english_definition": "to conceal, to hide (S)",
                "persian_definition_meaning": "پنهان کردن، مخفی کردن",
                "english_explanation": "This idiom is used for events which are potentially embarrassing to one's reputation, as well as against the law. The noun coverup can be formed.",
                "persian_explanation_meaning": "این اصطلاح برای رویدادهایی استفاده می‌شود که به طور بالقوه برای آبروی فرد شرم‌آور هستند، و همچنین خلاف قانون. اسم 'coverup' نیز می‌تواند از آن ساخته شود."
                ,
                "examples": [
                  {
                    "english_text": "The office worker tried to cover up his crimes, but everyone knew that he had been stealing office supplies all along.",
                    "persian_meaning": "کارمند اداره سعی کرد جرایم خود را پنهان کند، اما همه می‌دانستند که او از اول وسایل اداری می‌دزدید."
                  },
                  {
                    "english_text": "The political coverup of the bribery scandal failed and was reported by all the major media.",
                    "persian_meaning": "پنهان‌کاری سیاسی رسوایی رشوه شکست خورد و توسط تمام رسانه‌های اصلی گزارش شد."
                  }
                ]
              },
              {
                "english_phrase": "to drop off",
                "persian_phrase_meaning": "به خواب رفتن؛ به مکانی رساندن؛ کاهش یافتن",
                "english_definition": "to fall asleep; to take to a certain location (S); to decrease (for the third definition, also: to fall off)",
                "persian_definition_meaning": "به خواب رفتن؛ به مکان خاصی بردن؛ کاهش یافتن (برای تعریف سوم، همچنین: to fall off)",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "My mother dropped off during the boring television show; her head was nodding up and down.",
                    "persian_meaning": "مادرم حین تماشای برنامه تلویزیونی خسته‌کننده به خواب رفت؛ سرش بالا و پایین می‌رفت."
                  },
                  {
                    "english_text": "I don't mind dropping you off at the store on my way to work.",
                    "persian_meaning": "اشکالی ندارد که در مسیر کارم شما را جلوی فروشگاه پیاده کنم."
                  },
                  {
                    "english_text": "Business has been dropping off rapidly recently, but fortunately it hasn't been falling off as quickly as for our competitors.",
                    "persian_meaning": "کسب‌وکار اخیراً به سرعت در حال کاهش بوده، اما خوشبختانه به سرعت رقبای ما کاهش نیافته است."
                  }
                ]
              },
              {
                "english_phrase": "to turn over",
                "persian_phrase_meaning": "واژگون کردن؛ معکوس کردن؛ کنترل را واگذار کردن",
                "english_definition": "to place upside down (S); to flip, to turn upside down; to pass or give control to someone (S)",
                "persian_definition_meaning": "چیزی را وارونه قرار دادن؛ چیزی را چرخاندن یا وارونه کردن؛ کنترل یا مالکیت را به کسی واگذار کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "The teacher asked the students to turn the answer sheet over and to write a short essay on the back.",
                    "persian_meaning": "معلم از دانش‌آموزان خواست پاسخنامه را برگردانند و یک مقاله کوتاه در پشت آن بنویسند."
                  },
                  {
                    "english_text": "The car was going too fast around the corner and turned over twice.",
                    "persian_meaning": "ماشین در پیچ با سرعت زیادی می‌رفت و دوبار واژگون شد."
                  },
                  {
                    "english_text": "Mr. Collins has decided to turn over his jewelry store to his son at the end of the year.",
                    "persian_meaning": "آقای کالینز تصمیم گرفته است فروشگاه جواهرات خود را در پایان سال به پسرش واگذار کند."
                  }
                ]
              },
              {
                "english_phrase": "to go through channels",
                "persian_phrase_meaning": "درخواست را از طریق روش عادی پیگیری کردن",
                "english_definition": "to send a request through the normal way",
                "persian_definition_meaning": "درخواستی را از طریق راه عادی و سلسله مراتب اداری ارسال کردن",
                "english_explanation": "This idiom can be used with the adjective proper.",
                "persian_explanation_meaning": "این اصطلاح می‌تواند با صفت 'proper' استفاده شود."
                ,
                "examples": [
                  {
                    "english_text": "If you go through proper channels in this company, it's sometimes impossible to get anything done quickly.",
                    "persian_meaning": "اگر در این شرکت از طریق روال عادی پیش بروید، گاهی اوقات انجام سریع هیچ کاری غیرممکن است."
                  },
                  {
                    "english_text": "The police told the important civic leader that even she had to go through channels in reporting the burglary of her house.",
                    "persian_meaning": "پلیس به رهبر مهم مدنی گفت که حتی او هم باید برای گزارش سرقت خانه‌اش از طریق روال عادی پیش برود."
                  }
                ]
              },
              {
                "english_phrase": "last straw",
                "persian_phrase_meaning": "آخرین تحمل، آخرین حد",
                "english_definition": "the final event in a series of unacceptable actions",
                "persian_definition_meaning": "آخرین رویداد در یک سری از اقدامات غیرقابل قبول",
                "english_explanation": "This idiom is always used with the definite article the.",
                "persian_explanation_meaning": "این اصطلاح همیشه با حرف تعریف 'the' استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "When John asked to borrow money from me for the fourth time, it was the last straw. I finally told him that I couldn't lend him any more.",
                    "persian_meaning": "وقتی جان برای چهارمین بار از من درخواست پول کرد، کاسه صبرم لبریز شد. بالاخره به او گفتم دیگر نمی‌توانم به او قرض بدهم."
                  },
                  {
                    "english_text": "I can't believe that my roommate left the door to our apartment unlocked again. It's the last straw; I'm moving out.",
                    "persian_meaning": "باورم نمی‌شود که هم‌اتاقی‌ام دوباره در آپارتمانمان را باز گذاشت. این دیگر آخرین حد است؛ من در حال اثاث‌کشی هستم."
                  }
                ]
              }
            ]
          },
          {
            "lesson_number": 34,
            "lesson_name": "LESSON 34",
            "persian_lesson_name": "درس 34",
            "idioms": [
              {
                "english_phrase": "to get cold feet",
                "persian_phrase_meaning": "ترسیدن، دلسرد شدن (در لحظه آخر)",
                "english_definition": "to become unable or afraid to do something",
                "persian_definition_meaning": "ناتوان یا ترسیده شدن از انجام کاری",
                "english_explanation": "This idiom is usually used in the case of an important or dangerous action.",
                "persian_explanation_meaning": "این اصطلاح معمولاً در مورد یک اقدام مهم یا خطرناک استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "Karl was supposed to marry Elaine this weekend, but at the last moment he got cold feet.",
                    "persian_meaning": "قرار بود کارل این آخر هفته با الین ازدواج کند، اما در آخرین لحظه دلسرد شد."
                  },
                  {
                    "english_text": "Only one of the rock climbers got cold feet when the group reached the base of the hundred-meter cliff.",
                    "persian_meaning": "فقط یکی از صخره‌نوردان وقتی گروه به پای صخره صد متری رسید، ترسید."
                  }
                ]
              },
              {
                "english_phrase": "to trade in",
                "persian_phrase_meaning": "مبادله کردن (برای دریافت تخفیف خرید جدید)",
                "english_definition": "to receive credit for the value of an old item towards the purchase of a new item (S)",
                "persian_definition_meaning": "اعتبار گرفتن برای ارزش یک کالای قدیمی در ازای خرید کالای جدید",
                "english_explanation": "This idiom is used to form the noun trade-in.",
                "persian_explanation_meaning": "این اصطلاح برای ساختن اسم 'trade-in' استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "The car dealership offered me $1,000 for my old car if I traded it in for a new model.",
                    "persian_meaning": "نمایشگاه ماشین به من ۱۰۰۰ دلار برای ماشین قدیمی‌ام پیشنهاد داد اگر آن را با یک مدل جدید معاوضه کنم."
                  },
                  {
                    "english_text": "The appliance company was offering a $50 trade-in during the special promotion for its new line of refrigerators.",
                    "persian_meaning": "شرکت لوازم خانگی در طول تبلیغات ویژه برای خط جدید یخچال‌های خود، ۵۰ دلار تخفیف تعویض ارائه می‌کرد."
                  }
                ]
              },
              {
                "english_phrase": "face-to-face",
                "persian_phrase_meaning": "رو در رو، حضوری",
                "english_definition": "direct, personal; directly, personally (written without hyphens)",
                "persian_definition_meaning": "مستقیم، شخصی؛ مستقیماً، شخصاً (بدون خط تیره نوشته می‌شود)",
                "english_explanation": "This idiom can be used both as an adjective (the first definition) and as an adverb (the second definition).",
                "persian_explanation_meaning": "این اصطلاح می‌تواند هم به عنوان صفت (تعریف اول) و هم به عنوان قید (تعریف دوم) استفاده شود."
                ,
                "examples": [
                  {
                    "english_text": "The workers' representatives had a face-to-face meeting with management to resolve the salary issue.",
                    "persian_meaning": "نمایندگان کارگران برای حل مسئله حقوق، یک جلسه رو در رو با مدیریت داشتند."
                  },
                  {
                    "english_text": "The stepmother and her teenage son talked face to face about his troubles in school.",
                    "persian_meaning": "نامادری و پسر نوجوانش رو در رو درباره مشکلات او در مدرسه صحبت کردند."
                  }
                ]
              },
              {
                "english_phrase": "to be with (someone)",
                "persian_phrase_meaning": "حمایت کردن، موافق بودن؛ درک کردن",
                "english_definition": "to support, to back (also: to go along with); to understand or follow what someone is saying",
                "persian_definition_meaning": "حمایت کردن، پشتیبانی کردن (همچنین: to go along with)؛ درک کردن یا دنبال کردن آنچه کسی می‌گوید",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Although others thought that we shouldn't go along with Jerry, I told Jerry that I was with him on his proposal for reorganizing the staff.",
                    "persian_meaning": "گرچه دیگران فکر می‌کردند نباید با جری همراهی کنیم، من به جری گفتم که در مورد پیشنهادش برای سازماندهی مجدد کارکنان با او موافق هستم."
                  },
                  {
                    "english_text": "After turning left at the traffic light, go two blocks and turn right on Madison. After three more blocks, turn right again. Are you still with me?",
                    "persian_meaning": "بعد از پیچیدن به چپ در چراغ راهنمایی، دو بلوک بروید و در خیابان مدیسون به راست بپیچید. بعد از سه بلوک دیگر، دوباره به راست بپیچید. آیا هنوز متوجه حرفم هستید؟"
                  }
                ]
              },
              {
                "english_phrase": "to be with it",
                "persian_phrase_meaning": "تمرکز داشتن، هوشیار بودن",
                "english_definition": "to be able to focus or concentrate on (also: to get with it)",
                "persian_definition_meaning": "توانایی تمرکز کردن (همچنین: to get with it)",
                "english_explanation": "To be with it in the negative has the same meaning as to feel out of it. The related form to get with it is used in commands.",
                "persian_explanation_meaning": "عبارت 'to be with it' در حالت منفی همان معنای 'to feel out of it' را دارد. شکل مرتبط 'to get with it' در جملات امری استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "Jack's really with it today. I've never seen him play such good soccer.",
                    "persian_meaning": "جک امروز واقعاً سر حال است. هرگز او را ندیده‌ام که اینقدر خوب فوتبال بازی کند."
                  },
                  {
                    "english_text": "You've done only a small amount of work in two hours. You're not with it today, are you?",
                    "persian_meaning": "شما در دو ساعت فقط مقدار کمی کار انجام داده‌اید. امروز سر حال نیستید، نه؟"
                  },
                  {
                    "english_text": "It's no excuse to say that you feel out of it. We need everyone's help on this, so get with it!",
                    "persian_meaning": "این بهانه نیست که بگویید حالتان خوب نیست. ما به کمک همه در این مورد نیاز داریم، پس دست به کار شوید!"
                  }
                ]
              },
              {
                "english_phrase": "to fall for",
                "persian_phrase_meaning": "به سرعت عاشق شدن؛ گول خوردن",
                "english_definition": "to fall in love quickly; to be fooled or tricked by",
                "persian_definition_meaning": "به سرعت عاشق شدن؛ گول خوردن یا فریب خوردن توسط کسی",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Samantha and Derek never expected to fall for each other like they did, but they got married within two weeks of having met.",
                    "persian_meaning": "سامانتا و درک هرگز انتظار نداشتند که اینطور عاشق یکدیگر شوند، اما ظرف دو هفته پس از ملاقات ازدواج کردند."
                  },
                  {
                    "english_text": "The Masons wanted to believe their son, but unfortunately they had fallen for his lies too many times to be deceived once again.",
                    "persian_meaning": "میسون‌ها می‌خواستند پسرشان را باور کنند، اما متأسفانه بارها فریب دروغ‌هایش را خورده بودند که دوباره فریب بخورند."
                  }
                ]
              },
              {
                "english_phrase": "it figures",
                "persian_phrase_meaning": "منطقی به نظر می‌رسد، طبیعی است",
                "english_definition": "it seems likely, reasonable, or typical",
                "persian_definition_meaning": "به نظر محتمل، منطقی یا معمول می‌رسد",
                "english_explanation": "This idiom is either followed by a that-clause or by no other part of grammar.",
                "persian_explanation_meaning": "این اصطلاح یا با یک جمله 'that' همراه می‌شود یا هیچ بخش دستوری دیگری ندارد."
                ,
                "examples": [
                  {
                    "english_text": "It figures that the children were willing to help with the yardwork only if they received a rewarded for doing so.",
                    "persian_meaning": "طبیعی است که بچه‌ها فقط در صورتی حاضر به کمک در کارهای حیاط بودند که برای انجام آن پاداش بگیرند."
                  },
                  {
                    "english_text": "When I told Evan that his secretary was unhappy about not getting a raise, he said that it figured.",
                    "persian_meaning": "وقتی به ایوان گفتم که منشی‌اش از عدم دریافت افزایش حقوق ناراضی است، او گفت که طبیعی است."
                  }
                ]
              },
              {
                "english_phrase": "to fill (someone) in",
                "persian_phrase_meaning": "اطلاع دادن، اطلاعات پیش‌زمینه دادن",
                "english_definition": "to inform, to give background information to (also: to clue in) (S)",
                "persian_definition_meaning": "اطلاع دادن، اطلاعات پیش‌زمینه به کسی دادن (همچنین: to clue in)",
                "english_explanation": "This idiom is often followed by the preposition on and a noun phrase containing the pertinent information.",
                "persian_explanation_meaning": "این اصطلاح اغلب با حرف اضافه 'on' و یک عبارت اسمی حاوی اطلاعات مربوطه همراه می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "Could you fill me in on what is going to be discussed at tomorrow's meeting?",
                    "persian_meaning": "می‌توانید به من بگویید در جلسه فردا چه چیزی قرار است مورد بحث قرار گیرد؟"
                  },
                  {
                    "english_text": "Not having been to the convention, my associate asked me to clue him in on the proceedings.",
                    "persian_meaning": "همکارم که به کنوانسیون نرفته بود، از من خواست او را در جریان روند کار قرار دهم."
                  }
                ]
              },
              {
                "english_phrase": "to make (someone) tick",
                "persian_phrase_meaning": "محرک رفتار کسی بودن",
                "english_definition": "to motivate to behave or act in a certain way (S)",
                "persian_definition_meaning": "کسی را برای رفتار یا عمل به روشی خاص برانگیختن",
                "english_explanation": "This idiom is used within a what-clause.",
                "persian_explanation_meaning": "این اصطلاح در یک جمله با 'what' استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "If a salesperson knows what makes a customer tick, he will be able to sell a lot of merchandise.",
                    "persian_meaning": "اگر یک فروشنده بداند چه چیزی مشتری را به خرید ترغیب می‌کند، می‌تواند کالاهای زیادی بفروشد."
                  },
                  {
                    "english_text": "It's been impossible for us to figure out what makes our new boss tick. One moment she seems pleasant and then the next moment she's upset.",
                    "persian_meaning": "برای ما غیرممکن است که بفهمیم چه چیزی رئیس جدیدمان را تحریک می‌کند. یک لحظه او دلنشین به نظر می‌رسد و لحظه بعد ناراحت است."
                  }
                ]
              },
              {
                "english_phrase": "to cover for",
                "persian_phrase_meaning": "به جای کسی کار کردن؛ پنهان کردن خطای کسی",
                "english_definition": "to take someone's place temporarily, to substitute for; to protect someone by lying or deceiving",
                "persian_definition_meaning": "به طور موقت جای کسی را گرفتن، جایگزین شدن؛ کسی را با دروغ یا فریب محافظت کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Go ahead and take your coffee break. I'll cover for you until you return.",
                    "persian_meaning": "بفرمایید و استراحت قهوه خود را انجام دهید. من تا بازگشت شما به جای شما کار می‌کنم."
                  },
                  {
                    "english_text": "The criminal made his wife cover for him when the police asked if the man had been home all day. She swore that he had been there.",
                    "persian_meaning": "مجرم همسرش را مجبور کرد وقتی پلیس پرسید آیا مرد تمام روز در خانه بوده، او را پوشش دهد. او قسم خورد که مرد در خانه بوده است."
                  }
                ]
              },
              {
                "english_phrase": "to give (someone) a break",
                "persian_phrase_meaning": "فرصت دوباره دادن؛ از کسی توقع زیاد نداشتن؛ باور نکردن",
                "english_definition": "to provide a person with another opportunity or chance (S); not to expect too much work from (S); not to expect someone to believe (S)",
                "persian_definition_meaning": "به یک نفر فرصت یا شانس دیگری دادن؛ از کسی انتظار کار زیادی نداشتن؛ انتظار نداشتن کسی باور کند",
                "english_explanation": "Command forms are most common with this idiom. For the third definition, the pronoun me must be used.",
                "persian_explanation_meaning": "شکل‌های امری با این اصطلاح رایج‌ترین هستند. برای تعریف سوم، باید از ضمیر 'me' استفاده شود."
                ,
                "examples": [
                  {
                    "english_text": "The driver pleaded with the police officer to give him a break and not issue him a ticket for speeding.",
                    "persian_meaning": "راننده از افسر پلیس التماس کرد که به او تخفیف بدهد و برای سرعت غیرمجاز جریمه‌اش نکند."
                  },
                  {
                    "english_text": "When the students heard how much homework the teacher wanted them to do over the holiday, they begged, \"Give us a break, Professor Doyle!\"",
                    "persian_meaning": "وقتی دانش‌آموزان شنیدند که معلم چقدر تکلیف برای تعطیلات می‌خواهد، التماس کردند: «یک فرصت بدهید، پروفسور دویل!»"
                  },
                  {
                    "english_text": "Oh, Jim, give me a break! That's a terrible excuse for being late.",
                    "persian_meaning": "اوه، جیم، باورم نمی‌شود! این یک بهانه وحشتناک برای دیر آمدن است."
                  }
                ]
              },
              {
                "english_phrase": "to bow out",
                "persian_phrase_meaning": "کنار کشیدن، بازنشسته شدن",
                "english_definition": "to stop doing as a regular activity, to remove oneself from a situation",
                "persian_definition_meaning": "دست کشیدن از یک فعالیت منظم، خود را از یک موقعیت خارج کردن",
                "english_explanation": "The related idiom to want out indicates that someone desires to bow out.",
                "persian_explanation_meaning": "اصطلاح مرتبط 'to want out' نشان می‌دهد که کسی مایل به کنار کشیدن است."
                ,
                "examples": [
                  {
                    "english_text": "She bowed out as the school's registrar after sixteen years of service.",
                    "persian_meaning": "او پس از شانزده سال خدمت، از سمت مسئول ثبت‌نام مدرسه کناره‌گیری کرد."
                  },
                  {
                    "english_text": "One of the two partners wanted out of the deal because they couldn't agree on the terms of the contract.",
                    "persian_meaning": "یکی از دو شریک می‌خواست از معامله خارج شود زیرا نمی‌توانستند بر سر شرایط قرارداد به توافق برسند."
                  }
                ]
              }
            ]
          },
          {
            "lesson_number": 35,
            "lesson_name": "LESSON 35",
            "persian_lesson_name": "درس 35",
            "idioms": [
              {
                "english_phrase": "to pin on",
                "persian_phrase_meaning": "متهم کردن، گناه را به گردن کسی انداختن",
                "english_definition": "to find guilty of a crime or offense (S) (also: to hang on)",
                "persian_definition_meaning": "کسی را مقصر جرمی یا تخلفی دانستن (همچنین: to hang on)",
                "english_explanation": "This idiom is divided by a noun phrase containing the crime or offense. The accused person is mentioned after the preposition on.",
                "persian_explanation_meaning": "این اصطلاح با یک عبارت اسمی شامل جرم یا تخلف از هم جدا می‌شود. فرد متهم پس از حرف اضافه 'on' ذکر می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "The prosecuting attorney tried to pin the murder on the victim's husband, but the jury returned a verdict of \"not guilty.\"",
                    "persian_meaning": "دادستان تلاش کرد قتل را به گردن شوهر مقتول بیندازد، اما هیئت منصفه حکم «بی‌گناهی» را صادر کرد."
                  },
                  {
                    "english_text": "I wasn't anywhere near the window when it got broken. You can't pin that on me.",
                    "persian_meaning": "من اصلاً نزدیک پنجره نبودم وقتی شکست. نمی‌توانی آن را گردن من بیندازی."
                  }
                ]
              },
              {
                "english_phrase": "to get a rise out of",
                "persian_phrase_meaning": "کسی را تحریک به واکنش کردن (معمولا با خشم یا ناراحتی)",
                "english_definition": "to provoke a response from",
                "persian_definition_meaning": "برانگیختن پاسخی از کسی",
                "english_explanation": "This idiom is usually used when someone is teased into responding in anger or annoyance.",
                "persian_explanation_meaning": "این اصطلاح معمولاً زمانی استفاده می‌شود که کسی با آزار و اذیت وادار به واکنش با خشم یا ناراحتی می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "You can kid me all day about my mistake, but you won't get a rise out of me.",
                    "persian_meaning": "می‌توانی تمام روز در مورد اشتباه من شوخی کنی، اما نمی‌توانی مرا تحریک کنی."
                  },
                  {
                    "english_text": "I got a rise out of Marvin when I teased him about his weight. Marvin weighs over two-hundred pounds.",
                    "persian_meaning": "وقتی ماروین را به خاطر وزنش اذیت کردم، او را تحریک کردم. ماروین بیش از دویست پوند وزن دارد."
                  }
                ]
              },
              {
                "english_phrase": "to stick around",
                "persian_phrase_meaning": "ماندن، صبر کردن",
                "english_definition": "to stay or remain where one is, to wait",
                "persian_definition_meaning": "در جایی که هستی ماندن یا باقی ماندن، منتظر ماندن",
                "english_explanation": "This idiom is used when someone is waiting for something to happen or for someone to arrive",
                "persian_explanation_meaning": "این اصطلاح زمانی استفاده می‌شود که کسی منتظر اتفاقی یا آمدن کسی است."
                ,
                "examples": [
                  {
                    "english_text": "Todd had to stick around the house all day until the new furniture was finally delivered in the late afternoon.",
                    "persian_meaning": "تاد مجبور شد تمام روز در خانه بماند تا بالاخره مبلمان جدید در اواخر بعدازظهر تحویل داده شد."
                  },
                  {
                    "english_text": "Why don't you stick around for a while and see if Sarah eventually shows up?",
                    "persian_meaning": "چرا کمی نمی‌مانید و ببینید آیا سارا بالاخره پیدایش می‌شود؟"
                  }
                ]
              },
              {
                "english_phrase": "to pick up the tab",
                "persian_phrase_meaning": "هزینه را پرداخت کردن",
                "english_definition": "to pay the cost or bill",
                "persian_definition_meaning": "هزینه یا صورتحساب را پرداخت کردن",
                "english_explanation": "This idiom applies when someone pays for the cost of another person's meal, tickets, etc.",
                "persian_explanation_meaning": "این اصطلاح زمانی به کار می‌رود که کسی هزینه غذا، بلیت و غیره شخص دیگری را پرداخت می‌کند."
                ,
                "examples": [
                  {
                    "english_text": "The advertising manager is flying to Puerto Rico for a conference, and her firm is picking up the tab.",
                    "persian_meaning": "مدیر تبلیغات برای کنفرانسی به پورتوریکو پرواز می‌کند و شرکت او هزینه را پرداخت می‌کند."
                  },
                  {
                    "english_text": "The government picked up the tab for the visiting dignitary. It paid for all of the lodging and meals, as well as transportation, during his stay.",
                    "persian_meaning": "دولت هزینه مهمان عالی‌رتبه را پرداخت کرد. تمام هزینه‌های اقامت، غذا و حمل‌ونقل او را در طول اقامتش پرداخت کرد."
                  }
                ]
              },
              {
                "english_phrase": "by the way",
                "persian_phrase_meaning": "ضمناً، اتفاقاً",
                "english_definition": "incidentally",
                "persian_definition_meaning": "به طور اتفاقی",
                "english_explanation": "This idiom is used when someone thinks of something further in the course of a conversation.",
                "persian_explanation_meaning": "این اصطلاح زمانی استفاده می‌شود که کسی در حین مکالمه به چیز دیگری فکر می‌کند."
                ,
                "examples": [
                  {
                    "english_text": "Movies are my favorite form of entertainment. Oh, by the way, have you seen the new picture that's playing at the Bijou?",
                    "persian_meaning": "فیلم‌ها شکل مورد علاقه سرگرمی من هستند. آه، راستی، فیلم جدیدی که در سینما بیژو در حال نمایش است را دیده‌اید؟"
                  },
                  {
                    "english_text": "Vera's been divorced for three years now. She told me, by the way, that she never plans to remarry.",
                    "persian_meaning": "ورا حالا سه سال است که طلاق گرفته است. ضمناً به من گفت که هرگز قصد ازدواج مجدد ندارد."
                  }
                ]
              },
              {
                "english_phrase": "to go to town",
                "persian_phrase_meaning": "با شور و اشتیاق و کامل کاری را انجام دادن",
                "english_definition": "to do something with enthusiasm and thoroughness",
                "persian_definition_meaning": "انجام کاری با شور و اشتیاق و به طور کامل",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Our interior decorator really went to town in remodeling our living room. I'm afraid to ask how much it's going to cost.",
                    "persian_meaning": "طراح داخلی ما واقعاً در بازسازی اتاق نشیمن ما سنگ تمام گذاشت. می‌ترسم بپرسم چقدر هزینه خواهد داشت."
                  },
                  {
                    "english_text": "Charlie really went to town on his research project. He consulted over forty reference works and wrote a ninety-page report.",
                    "persian_meaning": "چارلی واقعاً روی پروژه تحقیقاتی خود سنگ تمام گذاشت. او به بیش از چهل اثر مرجع مراجعه کرد و یک گزارش نود صفحه‌ای نوشت."
                  }
                ]
              },
              {
                "english_phrase": "to let slide",
                "persian_phrase_meaning": "کوتاهی کردن در انجام وظیفه؛ نادیده گرفتن وضعیت",
                "english_definition": "to neglect a duty (S); to ignore a situation (S)",
                "persian_definition_meaning": "کوتاهی کردن در یک وظیفه؛ نادیده گرفتن یک وضعیت",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Terry knew that she should have paid the electric bill on time instead of letting it slide. Now the utility company has turned off her service.",
                    "persian_meaning": "تری می‌دانست که باید قبض برق را به موقع پرداخت می‌کرد به جای اینکه آن را نادیده بگیرد. حالا شرکت برق خدمات او را قطع کرده است."
                  },
                  {
                    "english_text": "When he tried to get a rise out of me by mentioning my failure to receive a promotion at work, I just let it slide.",
                    "persian_meaning": "وقتی او سعی کرد با اشاره به عدم دریافت ترفیع شغلی‌ام مرا تحریک کند، من فقط آن را نادیده گرفتم."
                  }
                ]
              },
              {
                "english_phrase": "search me",
                "persian_phrase_meaning": "نمی‌دانم (محاوره‌ای)",
                "english_definition": "I don't know (also: beats me)",
                "persian_definition_meaning": "نمی‌دانم (همچنین: beats me)",
                "english_explanation": "This idiom is used informally, usually as a command form.",
                "persian_explanation_meaning": "این اصطلاح به صورت غیررسمی و معمولاً به صورت امری استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "When Elmer asked his wife if she knew why the new neighbors left their garage door open all night, she responded, \"Search me.\"",
                    "persian_meaning": "وقتی المِر از همسرش پرسید آیا می‌داند چرا همسایه‌های جدید تمام شب در گاراژشان را باز گذاشته بودند، او پاسخ داد: «من چه می‌دانم.»"
                  },
                  {
                    "english_text": "When I asked Derek why his girlfriend wasn't at the party yet, he said, \"Beats me. I expected her an hour ago.\"",
                    "persian_meaning": "وقتی از درک پرسیدم چرا دوست‌دخترش هنوز به مهمانی نیامده، او گفت: «من چه می‌دانم. یک ساعت پیش انتظارش را داشتم.»"
                  }
                ]
              },
              {
                "english_phrase": "to get off one's chest",
                "persian_phrase_meaning": "احساسات واقعی خود را بیان کردن",
                "english_definition": "to express one's true feelings (S)",
                "persian_definition_meaning": "ابراز احساسات واقعی خود",
                "english_explanation": "This idiom is used when someone has long waited to express themselves.",
                "persian_explanation_meaning": "این اصطلاح زمانی استفاده می‌شود که کسی مدت‌ها منتظر بوده تا خودش را ابراز کند."
                ,
                "examples": [
                  {
                    "english_text": "Ellen felt a lot better when she finally talked to a counselor and got the problem off her chest.",
                    "persian_meaning": "الن وقتی بالاخره با یک مشاور صحبت کرد و مشکل را از دلش بیرون کرد، خیلی بهتر شد."
                  },
                  {
                    "english_text": "Faye hasn't shared her concern about her marriage with her husband yet. I think that she should get it off her chest soon.",
                    "persian_meaning": "فی هنوز نگرانی خود را در مورد ازدواجش با همسرش در میان نگذاشته است. فکر می‌کنم او باید هر چه زودتر آن را از دلش بیرون کند."
                  }
                ]
              },
              {
                "english_phrase": "to live it up",
                "persian_phrase_meaning": "ولخرجی کردن، لوکس زندگی کردن",
                "english_definition": "to spend money freely, to live luxuriously",
                "persian_definition_meaning": "آزادانه پول خرج کردن، لوکس زندگی کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Kyle and Eric saved up money for two years so that they could travel to Europe and live it up.",
                    "persian_meaning": "کایل و اریک به مدت دو سال پول پس‌انداز کردند تا بتوانند به اروپا سفر کنند و زندگی مجللی داشته باشند."
                  },
                  {
                    "english_text": "After receiving a large inheritance from a rich aunt, I was able to live it up for years.",
                    "persian_meaning": "پس از دریافت یک ارث بزرگ از عمه ثروتمند، توانستم سال‌ها زندگی مجللی داشته باشم."
                  }
                ]
              },
              {
                "english_phrase": "to liven up",
                "persian_phrase_meaning": "پرانرژی کردن، فعال‌تر کردن",
                "english_definition": "to energize, to make more active (also: to pick up)",
                "persian_definition_meaning": "پرانرژی کردن، فعال‌تر کردن (همچنین: to pick up)",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "The teacher occasionally took the class on field trips just to liven things up a bit.",
                    "persian_meaning": "معلم گاهی اوقات کلاس را به اردو می‌برد تا کمی اوضاع را پرانرژی کند."
                  },
                  {
                    "english_text": "The animals in the zoo began to liven up when evening came and the temperatures dropped.",
                    "persian_meaning": "حیوانات در باغ وحش وقتی شب شد و دما کاهش یافت، شروع به فعال شدن کردند."
                  },
                  {
                    "english_text": "Many people have to drink coffee every morning just to pick themselves up.",
                    "persian_meaning": "بسیاری از مردم باید هر روز صبح قهوه بنوشند تا خودشان را سرحال کنند."
                  }
                ]
              },
              {
                "english_phrase": "to have a voice in",
                "persian_phrase_meaning": "در چیزی مشارکت داشتن، حق اظهار نظر داشتن",
                "english_definition": "to share involvement in",
                "persian_definition_meaning": "مشارکت داشتن در",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "The new vice-president was promised that she would have a voice in developing the company's international expansion.",
                    "persian_meaning": "به معاون جدید قول داده شد که در توسعه گسترش بین‌المللی شرکت حق اظهار نظر خواهد داشت."
                  },
                  {
                    "english_text": "The students are trying to have a voice in college affairs by gaining representation on administrative committees.",
                    "persian_meaning": "دانش‌آموزان در تلاشند با کسب نمایندگی در کمیته‌های اداری، در امور کالج حق اظهار نظر داشته باشند."
                  }
                ]
              }
            ]
          },
          {
            "lesson_number": 36,
            "lesson_name": "LESSON 36",
            "persian_lesson_name": "درس 36",
            "idioms": [
              {
                "english_phrase": "to check in",
                "persian_phrase_meaning": "پذیرش گرفتن (در هتل)؛ تحویل دادن (چمدان، وسایل)",
                "english_definition": "to register at a hotel or motel; to leave or deposit for transporting or safekeeping (S)",
                "persian_definition_meaning": "در یک هتل یا متل پذیرش گرفتن؛ برای حمل و نقل یا نگهداری چیزی را تحویل دادن یا واریز کردن",
                "english_explanation": "The adjective form check-in derives from this idiom.",
                "persian_explanation_meaning": "شکل صفت 'check-in' از این اصطلاح مشتق می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "Courtney arrived in town at mid-day and promptly checked in at the Plaza Hotel. The hotel permitted an early check-in time.",
                    "persian_meaning": "کورتنی ظهر به شهر رسید و بلافاصله در هتل پلازا پذیرش گرفت. هتل اجازه پذیرش زودهنگام را می‌داد."
                  },
                  {
                    "english_text": "There dozens of people at the airline counters waiting to check their bags in for their flights.",
                    "persian_meaning": "ده‌ها نفر در باجه‌های هواپیمایی منتظر بودند تا چمدان‌هایشان را برای پروازهایشان تحویل دهند."
                  }
                ]
              },
              {
                "english_phrase": "to check out",
                "persian_phrase_meaning": "تسویه‌حساب کردن (از هتل)؛ بررسی کردن، تحقیق کردن",
                "english_definition": "to pay the bill at a hotel or motel and then leave; to investigate, to examine (S)",
                "persian_definition_meaning": "صورتحساب هتل یا متل را پرداخت کرده و سپس آنجا را ترک کردن؛ بررسی کردن، معاینه کردن",
                "english_explanation": "The adjective form check-out derives from this idiom.",
                "persian_explanation_meaning": "شکل صفت 'check-out' از این اصطلاح مشتق می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "The latest you should check out of the hotel is 12 noon. However, in your case, we can set a special check-out time of 2:00 P.M.",
                    "persian_meaning": "حداکثر زمانی که باید از هتل تسویه‌حساب کنید، ساعت ۱۲ ظهر است. اما در مورد شما، می‌توانیم زمان تسویه‌حساب ویژه‌ای را ساعت ۲ بعدازظهر تعیین کنیم."
                  },
                  {
                    "english_text": "The police received a call from someone claiming to have witnessed a murder. The police sent two detectives to check the call out right away.",
                    "persian_meaning": "پلیس تماسی از کسی دریافت کرد که ادعا می‌کرد شاهد یک قتل بوده است. پلیس دو کارآگاه فرستاد تا فوراً تماس را بررسی کنند."
                  }
                ]
              },
              {
                "english_phrase": "to take at one's word",
                "persian_phrase_meaning": "حرف کسی را باور کردن",
                "english_definition": "to accept what one says as true, to believe",
                "persian_definition_meaning": "آنچه را که کسی می‌گوید حقیقت پذیرفتن، باور کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "When he offered to be responsible for the fund raiser, I took him at his word. Now he's saying that he's not available to do it.",
                    "persian_meaning": "وقتی پیشنهاد داد مسئول جمع‌آوری کمک مالی باشد، حرفش را باور کردم. حالا می‌گوید که برای انجام آن در دسترس نیست."
                  },
                  {
                    "english_text": "You should be careful about taking her at her word. She's been known to say one thing but to do another.",
                    "persian_meaning": "باید مراقب باشید که حرفش را باور کنید. او معروف است که یک چیز می‌گوید و کار دیگری انجام می‌دهد."
                  }
                ]
              },
              {
                "english_phrase": "to serve (the/one's) purpose",
                "persian_phrase_meaning": "کارآمد بودن، نیازها را برآورده کردن",
                "english_definition": "to be useful, to suit one's needs or requirements",
                "persian_definition_meaning": "مفید بودن، مناسب نیازها یا الزامات کسی بودن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "I don't have a screwdriver to open this, but I think that a knife will serve the purpose.",
                    "persian_meaning": "من پیچ‌گوشتی برای باز کردن این ندارم، اما فکر می‌کنم یک چاقو این کار را انجام می‌دهد."
                  },
                  {
                    "english_text": "Jane prefers working to studying, so it served her purpose to drop out of school and take that job.",
                    "persian_meaning": "جین کار کردن را به درس خواندن ترجیح می‌دهد، بنابراین ترک تحصیل و گرفتن آن شغل به نفع او بود."
                  }
                ]
              },
              {
                "english_phrase": "in the worst way",
                "persian_phrase_meaning": "بسیار زیاد، شدیداً",
                "english_definition": "very much, greatly",
                "persian_definition_meaning": "بسیار زیاد، به شدت",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Jim and Claudia want to have children in the worst way. They are trying very hard to conceive.",
                    "persian_meaning": "جیم و کلودیا به شدت می‌خواهند بچه‌دار شوند. آن‌ها بسیار تلاش می‌کنند تا باردار شوند."
                  },
                  {
                    "english_text": "Because Omer has relatives in Turkey, he wants to visit there in the worst way.",
                    "persian_meaning": "چون عمر در ترکیه فامیل دارد، به شدت می‌خواهد به آنجا سفر کند."
                  }
                ]
              },
              {
                "english_phrase": "to cop out",
                "persian_phrase_meaning": "از مسئولیت شانه خالی کردن، کناره‌گیری کردن",
                "english_definition": "to avoid one's responsibility, to quit",
                "persian_definition_meaning": "از مسئولیت خود شانه خالی کردن، دست کشیدن",
                "english_explanation": "This idiom is an informal version of the second definition to back out (lesson 29). The noun form copout means an excuse for avoiding responsibility.",
                "persian_explanation_meaning": "این اصطلاح یک نسخه غیررسمی از تعریف دوم 'to back out' (درس ۲۹) است. شکل اسمی 'copout' به معنای بهانه‌ای برای فرار از مسئولیت است."
                ,
                "examples": [
                  {
                    "english_text": "Evelyn had agreed to help us with arrangements for the party, but she copped out at the last minute.",
                    "persian_meaning": "اولین موافقت کرده بود که در ترتیب دادن مهمانی به ما کمک کند، اما در آخرین لحظه شانه خالی کرد."
                  },
                  {
                    "english_text": "I can't believe that Cindy offered such an explanation for failing to show up. What a poor copout!",
                    "persian_meaning": "باورم نمی‌شود که سیندی چنین توضیحی برای غیبتش ارائه کرد. چه بهانه بی‌ارزشی!"
                  }
                ]
              },
              {
                "english_phrase": "to line up",
                "persian_phrase_meaning": "صف کشیدن؛ ترتیب دادن، فراهم کردن",
                "english_definition": "to form a line; to arrange to have, to manage to obtain (S)",
                "persian_definition_meaning": "صف تشکیل دادن؛ ترتیب دادن چیزی، موفق به بدست آوردن چیزی شدن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "The moviegoers lined up in front of the theater showing the most popular film of the summer.",
                    "persian_meaning": "تماشاگران فیلم جلوی سینمایی که محبوب‌ترین فیلم تابستان را نمایش می‌داد، صف کشیدند."
                  },
                  {
                    "english_text": "Rob is going to schedule the famous author to speak at the convention if he can line her up in time.",
                    "persian_meaning": "راب قصد دارد نویسنده معروف را برای سخنرانی در کنفرانس برنامه‌ریزی کند اگر بتواند او را به موقع هماهنگ کند."
                  }
                ]
              },
              {
                "english_phrase": "to lose one's cool",
                "persian_phrase_meaning": "عصبانی شدن، دستپاچه شدن",
                "english_definition": "to get excited, angry, or flustered",
                "persian_definition_meaning": "هیجان‌زده، عصبانی یا دستپاچه شدن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Despite the boos from some in the audience, the actors on stage never lost their cool.",
                    "persian_meaning": "با وجود هو کردن برخی از تماشاگران، بازیگران روی صحنه هرگز خونسردی خود را از دست ندادند."
                  },
                  {
                    "english_text": "Although the group of skiers were in danger from an apparent avalanche, their ski guide never lost his cool.",
                    "persian_meaning": "با وجود اینکه گروه اسکی‌بازان در خطر بهمن آشکار قرار داشتند، راهنمای اسکی آن‌ها هرگز خونسردی خود را از دست نداد."
                  }
                ]
              },
              {
                "english_phrase": "to leave open",
                "persian_phrase_meaning": "تصمیم‌گیری در مورد چیزی را به تعویق انداختن",
                "english_definition": "to delay making a decision on (S)",
                "persian_definition_meaning": "به تاخیر انداختن تصمیم‌گیری در مورد چیزی",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "In making up the job announcement, the firm decided to leave the salary open until a qualified candidate was found.",
                    "persian_meaning": "در تهیه آگهی شغلی، شرکت تصمیم گرفت حقوق را تا زمانی که یک نامزد واجد شرایط پیدا شود، باز بگذارد."
                  },
                  {
                    "english_text": "We know that the annual summer camp will be held in August, but let's leave the exact dates open for now.",
                    "persian_meaning": "می‌دانیم که اردوگاه تابستانی سالانه در ماه اوت برگزار می‌شود، اما فعلاً تاریخ‌های دقیق را باز بگذاریم."
                  }
                ]
              },
              {
                "english_phrase": "to turn on",
                "persian_phrase_meaning": "بسیار علاقه‌مند کردن، هیجان‌زده کردن",
                "english_definition": "to interest greatly, to excite (S)",
                "persian_definition_meaning": "بسیار علاقه‌مند کردن، هیجان‌زده کردن",
                "english_explanation": "The idiom with the opposite meaning is to turn off. These idioms are used to form the nouns turnon and turnoff.",
                "persian_explanation_meaning": "اصطلاح با معنی مخالف 'to turn off' است. این اصطلاحات برای تشکیل اسامی 'turnon' و 'turnoff' استفاده می‌شوند."
                ,
                "examples": [
                  {
                    "english_text": "Does great art turn you on? I find going to a museum and viewing classic works of art a real turnon.",
                    "persian_meaning": "آیا هنر عالی شما را هیجان‌زده می‌کند؟ رفتن به موزه و تماشای آثار هنری کلاسیک برای من واقعاً هیجان‌انگیز است."
                  },
                  {
                    "english_text": "Going to a bar and having silly conversation with strangers really turns me off. In fact, most bar scenes are really turnoffs to me.",
                    "persian_meaning": "رفتن به بار و داشتن مکالمات بیهوده با غریبه‌ها واقعاً مرا دلسرد می‌کند. در واقع، بیشتر صحنه‌های بار برای من دلسردکننده هستند."
                  }
                ]
              },
              {
                "english_phrase": "to miss the boat",
                "persian_phrase_meaning": "فرصت را از دست دادن، شکست خوردن",
                "english_definition": "to lose an opportunity, to fail in some undertaking",
                "persian_definition_meaning": "از دست دادن یک فرصت، شکست خوردن در یک سرمایه‌گذاری",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "The precious metals market was looking up several months ago, but unfortunately most investors missed the boat.",
                    "persian_meaning": "بازار فلزات گرانبها چند ماه پیش رو به بهبود بود، اما متأسفانه بیشتر سرمایه‌گذاران فرصت را از دست دادند."
                  },
                  {
                    "english_text": "Mr. Vlasic's new business went bankrupt within a short time. He really missed the boat by opening a tanning salon near the beach.",
                    "persian_meaning": "کسب‌وکار جدید آقای ولاسیچ در مدت کوتاهی ورشکست شد. او واقعاً با افتتاح یک سالن برنزه کردن در نزدیکی ساحل فرصت را از دست داد."
                  }
                ]
              },
              {
                "english_phrase": "to think up",
                "persian_phrase_meaning": "اختراع کردن، خلق کردن (ایده غیرمعمول)",
                "english_definition": "to invent, to create (also: to dream up)",
                "persian_definition_meaning": "اختراع کردن، خلق کردن (همچنین: to dream up)",
                "english_explanation": "This idiom is often used for an unusual or foolish thought.",
                "persian_explanation_meaning": "این اصطلاح اغلب برای یک فکر غیرمعمول یا احمقانه استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "Who thought up the idea of painting the living room walls bright red?",
                    "persian_meaning": "چه کسی ایده رنگ کردن دیوارهای اتاق نشیمن به رنگ قرمز روشن را مطرح کرد؟"
                  },
                  {
                    "english_text": "When asked by the teacher why she was late, the student dreamed up a plausible excuse.",
                    "persian_meaning": "وقتی معلم از او پرسید چرا دیر کرده، دانش‌آموز یک بهانه باورپذیر ساخت."
                  }
                ]
              }
            ]
          },
          {
            "lesson_number": 37,
            "lesson_name": "LESSON 37",
            "persian_lesson_name": "درس 37",
            "idioms": [
              {
                "english_phrase": "to throw (someone) a curve",
                "persian_phrase_meaning": "موضوع غیرمنتظره‌ای را مطرح کردن (باعث خجالت شدن)",
                "english_definition": "to introduce an unexpected topic, causing embarrassment (S)",
                "persian_definition_meaning": "موضوعی غیرمنتظره را مطرح کردن که باعث خجالت می‌شود",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "The first week of class was going very well until a student threw the teacher a curve by suggesting that the textbook was too difficult.",
                    "persian_meaning": "هفته اول کلاس خیلی خوب پیش می‌رفت تا اینکه یک دانش‌آموز با پیشنهاد اینکه کتاب درسی خیلی دشوار است، معلم را در موقعیت دشواری قرار داد."
                  },
                  {
                    "english_text": "The director asked us in advance to stick to the meeting agenda and not to throw him any curves.",
                    "persian_meaning": "کارگردان از ما از قبل خواست که به دستور جلسه پایبند باشیم و هیچ موضوع غیرمنتظره‌ای را مطرح نکنیم."
                  }
                ]
              },
              {
                "english_phrase": "to make waves",
                "persian_phrase_meaning": "ایجاد مشکل کردن، سر و صدا کردن (معمولاً با شکایت)",
                "english_definition": "to create a disturbance, usually by complaining",
                "persian_definition_meaning": "ایجاد اختلال کردن، معمولاً با شکایت",
                "english_explanation": "This idiom is similar in meaning to the previous idiom, but the emphasis is on the aspect of complaining rather than causing embarrassment.",
                "persian_explanation_meaning": "این اصطلاح از نظر معنایی شبیه اصطلاح قبلی است، اما تاکید آن بر جنبه شکایت کردن است تا ایجاد خجالت."
                ,
                "examples": [
                  {
                    "english_text": "In most companies, an employee who makes waves is not appreciated.",
                    "persian_meaning": "در بیشتر شرکت‌ها، کارمندی که سر و صدا می‌کند مورد قدردانی قرار نمی‌گیرد."
                  },
                  {
                    "english_text": "The meeting was going smoothly until one of the participants made waves about the newly revised compensation package.",
                    "persian_meaning": "جلسه به آرامی پیش می‌رفت تا اینکه یکی از شرکت‌کنندگان در مورد بسته حقوقی جدید سر و صدا کرد."
                  }
                ]
              },
              {
                "english_phrase": "to carry on",
                "persian_phrase_meaning": "ادامه دادن؛ انجام دادن؛ به شیوه بچگانه رفتار کردن",
                "english_definition": "to continue as before; to conduct, to engage in; to behave in an immature manner",
                "persian_definition_meaning": "به روال سابق ادامه دادن؛ انجام دادن، مشغول شدن به؛ به شیوه‌ای نابالغانه رفتار کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Even in the face of disaster, the inhabitants carried on as though nothing had happened.",
                    "persian_meaning": "حتی در مواجهه با فاجعه، ساکنان طوری ادامه دادند که انگار هیچ اتفاقی نیفتاده است."
                  },
                  {
                    "english_text": "The business associates decided to carry on their discussion in the hotel bar instead of the conference room.",
                    "persian_meaning": "همکاران تجاری تصمیم گرفتند بحث خود را به جای اتاق کنفرانس، در بار هتل ادامه دهند."
                  },
                  {
                    "english_text": "I can't believe that John carried on so much just because his dog died. He looked depressed and cried for weeks after it happened.",
                    "persian_meaning": "باورم نمی‌شود که جان فقط به خاطر مرگ سگش اینقدر بچگانه رفتار کرد. او پس از این اتفاق افسرده به نظر می‌رسید و هفته‌ها گریه کرد."
                  }
                ]
              },
              {
                "english_phrase": "not on your life",
                "persian_phrase_meaning": "به هیچ وجه، هرگز",
                "english_definition": "absolutely not (also: no way)",
                "persian_definition_meaning": "کاملاً نه (همچنین: no way)",
                "english_explanation": "This idiom is used as a kind of exclamation by itself.",
                "persian_explanation_meaning": "این اصطلاح به تنهایی به عنوان یک نوع تعجب به کار می‌رود."
                ,
                "examples": [
                  {
                    "english_text": "You're asking me to invest in that poorly rated company just because you know the son of the president? Not on your life!",
                    "persian_meaning": "شما از من می‌خواهید در آن شرکت کم‌ارزش فقط به خاطر اینکه پسر رئیسش را می‌شناسید، سرمایه‌گذاری کنم؟ هرگز!"
                  },
                  {
                    "english_text": "When a friend tried to get Mark to jump out of a plane with a parachute, he immediately responded, \"No way!\"",
                    "persian_meaning": "وقتی دوستی سعی کرد مارک را وادار کند با چتر نجات از هواپیما بپرد، او بلافاصله پاسخ داد: «به هیچ وجه!»"
                  }
                ]
              },
              {
                "english_phrase": "to cover ground",
                "persian_phrase_meaning": "گسترده بودن، مطالب زیادی را پوشش دادن",
                "english_definition": "to be extensive, to discuss much material",
                "persian_definition_meaning": "گسترده بودن، مطالب زیادی را مورد بحث قرار دادن",
                "english_explanation": "Forms such as a lot of, too much, too little are used before the noun ground.",
                "persian_explanation_meaning": "شکل‌هایی مانند 'a lot of', 'too much', 'too little' قبل از اسم 'ground' استفاده می‌شوند."
                ,
                "examples": [
                  {
                    "english_text": "That national commission's report on urban ghettos covers a lot of ground. Many of the recommendations are too costly to implement.",
                    "persian_meaning": "گزارش کمیسیون ملی درباره محله‌های فقیرنشین شهری مطالب زیادی را پوشش می‌دهد. بسیاری از توصیه‌ها برای اجرا بیش از حد پرهزینه هستند."
                  },
                  {
                    "english_text": "In his first lecture on Greek philosophers, I thought that our professor covered too little ground.",
                    "persian_meaning": "در اولین سخنرانی او درباره فیلسوفان یونانی، فکر کردم که استاد ما مطالب بسیار کمی را پوشش داد."
                  }
                ]
              },
              {
                "english_phrase": "to mind the store",
                "persian_phrase_meaning": "مسئول اداره یا مکانی بودن (هنگامی که دیگران نیستند)",
                "english_definition": "to be responsible for an office while others are gone",
                "persian_definition_meaning": "مسئولیت یک دفتر را بر عهده داشتن در حالی که دیگران رفته‌اند",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "It seems that all of our employees are taking a lunch break at the same time. I wonder who's minding the store.",
                    "persian_meaning": "به نظر می‌رسد همه کارمندان ما همزمان ناهار می‌خورند. نمی‌دانم چه کسی مسئول دفتر است."
                  },
                  {
                    "english_text": "Lynne agreed to mind the store while the others went outside to watch the parade passing by.",
                    "persian_meaning": "لین موافقت کرد که مسئول دفتر باشد در حالی که دیگران برای تماشای رژه از بیرون رفتند."
                  }
                ]
              },
              {
                "english_phrase": "to throw the book at",
                "persian_phrase_meaning": "با حداکثر مجازات تنبیه کردن، سخت‌گیرانه رفتار کردن",
                "english_definition": "to punish with full penalty, to be harsh on",
                "persian_definition_meaning": "با حداکثر مجازات تنبیه کردن، سخت‌گیرانه رفتار کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Because the criminal was a repeat offender, the judge threw the book at him with heavy fines and a long prison term.",
                    "persian_meaning": "از آنجا که مجرم سابقه داشت، قاضی او را با جریمه‌های سنگین و حبس طولانی به شدت مجازات کرد."
                  },
                  {
                    "english_text": "My boss threw the book at me when he discovered that I had been using company time for personal business. I was severely reprimanded and forced to make up the lost time.",
                    "persian_meaning": "رئیسم وقتی فهمید که من از وقت شرکت برای کارهای شخصی استفاده می‌کردم، مرا به شدت مجازات کرد. من به شدت توبیخ شدم و مجبور شدم وقت از دست رفته را جبران کنم."
                  }
                ]
              },
              {
                "english_phrase": "to put one's foot in",
                "persian_phrase_meaning": "اشتباه گفتن یا انجام دادن",
                "english_definition": "to say or do the wrong thing",
                "persian_definition_meaning": "چیز اشتباهی گفتن یا کار اشتباهی انجام دادن",
                "english_explanation": "This idiom is used with the noun phrase one's mouth or the pronoun it.",
                "persian_explanation_meaning": "این اصطلاح با عبارت اسمی 'one's mouth' یا ضمیر 'it' استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "Fred really put his foot in his mouth when he called his supervisor by the wrong name.",
                    "persian_meaning": "فرد واقعاً وقتی سرپرستش را با نام اشتباه صدا زد، گاف بزرگی داد."
                  },
                  {
                    "english_text": "I really put my foot in it when I forgot my girlfriend's birthday and didn't buy her anything. She almost lost her cool.",
                    "persian_meaning": "واقعاً گاف بزرگی دادم وقتی تولد دوست‌دخترم را فراموش کردم و برایش چیزی نخریدم. او تقریباً از کوره در رفت."
                  }
                ]
              },
              {
                "english_phrase": "to be up for grabs",
                "persian_phrase_meaning": "قابل دستیابی برای دیگران بودن",
                "english_definition": "to become available to others",
                "persian_definition_meaning": "برای دیگران در دسترس قرار گرفتن",
                "english_explanation": "This idiom is used when something is highly desirable to many other people.",
                "persian_explanation_meaning": "این اصطلاح زمانی استفاده می‌شود که چیزی برای بسیاری از افراد دیگر بسیار مطلوب است."
                ,
                "examples": [
                  {
                    "english_text": "When one of the full-time contract instructors stepped down, her nice office overlooking the river was up for grabs.",
                    "persian_meaning": "وقتی یکی از استادان تمام وقت قراردادی کنار کشید، دفتر زیبایش با منظره رودخانه قابل دستیابی شد."
                  },
                  {
                    "english_text": "Did you know that Senator Stone is retiring and that her Senate seat is up for grabs?",
                    "persian_meaning": "آیا می‌دانستید که سناتور استون بازنشسته می‌شود و کرسی سنای او در دسترس است؟"
                  }
                ]
              },
              {
                "english_phrase": "to show off",
                "persian_phrase_meaning": "خودنمایی کردن؛ به نمایش گذاشتن",
                "english_definition": "to display one's ability in order to attract attention (S); to let others see, to expose to public view (S)",
                "persian_definition_meaning": "توانایی‌های خود را به منظور جلب توجه به نمایش گذاشتن؛ به دیگران نشان دادن، در معرض دید عموم قرار دادن",
                "english_explanation": "This idiom can form the noun showoff for the first definition.",
                "persian_explanation_meaning": "این اصطلاح می‌تواند اسم 'showoff' را برای تعریف اول تشکیل دهد."
                ,
                "examples": [
                  {
                    "english_text": "Elizabeth is an excellent swimmer, but I don't like the way she shows off in front of everyone. It's very obvious that she enjoys being a showoff.",
                    "persian_meaning": "الیزابت شناگر ماهری است، اما من از نحوه خودنمایی او در مقابل همه خوشم نمی‌آید. بسیار واضح است که او از خودنمایی لذت می‌برد."
                  },
                  {
                    "english_text": "Jacquie showed her large wedding ring off to all her friends.",
                    "persian_meaning": "جکی انگشتر بزرگ ازدواجش را به تمام دوستانش نشان داد."
                  }
                ]
              },
              {
                "english_phrase": "to learn the ropes",
                "persian_phrase_meaning": "قلق کار را یاد گرفتن، با روال آشنا شدن",
                "english_definition": "to become familiar with routine procedures at work or school",
                "persian_definition_meaning": "آشنا شدن با روال عادی کار یا مدرسه",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "The job applicant didn't have much previous experience or knowledge, but she seemed intelligent enough to learn the ropes quickly.",
                    "persian_meaning": "متقاضی کار تجربه یا دانش قبلی زیادی نداشت، اما به نظر می‌رسید به اندازه کافی باهوش است که سریع قلق کار را یاد بگیرد."
                  },
                  {
                    "english_text": "It took the new schoolteacher a year to learn the ropes regarding administrative and curricular matters.",
                    "persian_meaning": "یک سال طول کشید تا معلم جدید با مسائل اداری و درسی آشنا شود."
                  }
                ]
              },
              {
                "english_phrase": "to keep one's fingers crossed",
                "persian_phrase_meaning": "آرزوی موفقیت کردن، امیدوار بودن",
                "english_definition": "to hope to have good results, to hope that nothing bad will happen",
                "persian_definition_meaning": "امیدوار بودن به نتایج خوب، امیدوار بودن به عدم اتفاق بد",
                "english_explanation": "This idiom reflects the way people cross their fingers to hope for good luck.",
                "persian_explanation_meaning": "این اصطلاح منعکس‌کننده روشی است که افراد برای آرزوی موفقیت انگشتان خود را ضربدر می‌کنند."
                ,
                "examples": [
                  {
                    "english_text": "Let's keep our fingers crossed that we got passing grades on that college entrance exam.",
                    "persian_meaning": "بیایید امیدوار باشیم که نمرات قبولی را در آن امتحان ورودی دانشگاه گرفتیم."
                  },
                  {
                    "english_text": "Jerry kept his fingers crossed that the good weather would hold up for the picnic he was planning for the coming weekend.",
                    "persian_meaning": "جری امیدوار بود که آب و هوای خوب برای پیک‌نیکی که برای آخر هفته آینده برنامه‌ریزی کرده بود، ادامه یابد."
                  }
                ]
              }
            ]
          },
          {
            "lesson_number": 38,
            "lesson_name": "LESSON 38",
            "persian_lesson_name": "درس 38",
            "idioms": [
              {
                "english_phrase": "to land on one's feet",
                "persian_phrase_meaning": "به سلامت از موقعیت ناخوشایند یا خطرناک خارج شدن، روی پا ایستادن",
                "english_definition": "to recover safely from an unpleasant or dangerous situation",
                "persian_definition_meaning": "به سلامت از یک موقعیت ناخوشایند یا خطرناک بهبود یافتن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "After a series of personal and professional difficulties, it's amazing that George has landed on his feet so quickly.",
                    "persian_meaning": "پس از یک سری مشکلات شخصی و حرفه‌ای، شگفت‌انگیز است که جورج اینقدر سریع روی پا ایستاده است."
                  },
                  {
                    "english_text": "Some young adults get into so much trouble at school that they are never able to land on their feet again. They drop out before graduating.",
                    "persian_meaning": "برخی از جوانان در مدرسه آنقدر دچار مشکل می‌شوند که هرگز نمی‌توانند دوباره روی پا بایستند. آن‌ها قبل از فارغ‌التحصیلی ترک تحصیل می‌کنند."
                  }
                ]
              },
              {
                "english_phrase": "to dish out",
                "persian_phrase_meaning": "به مقدار زیاد توزیع کردن؛ انتقاد کردن از دیگران",
                "english_definition": "to distribute in large quantity (S); to speak of others in a critical manner (S)",
                "persian_definition_meaning": "به مقدار زیاد توزیع کردن؛ با لحنی انتقادی در مورد دیگران صحبت کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Mary's mom dished out two or three scoops of ice cream for each child at the birthday party.",
                    "persian_meaning": "مامان مری دو یا سه اسکوپ بستنی برای هر کودک در مهمانی تولد توزیع کرد."
                  },
                  {
                    "english_text": "Larry can't seem to take any criticism of his actions but he certainly likes to dish it out.",
                    "persian_meaning": "لری ظاهراً نمی‌تواند هیچ انتقادی از اقداماتش را تحمل کند اما قطعاً دوست دارد خودش انتقاد کند."
                  }
                ]
              },
              {
                "english_phrase": "to get through to",
                "persian_phrase_meaning": "با کسی ارتباط برقرار کردن، متوجه کردن کسی",
                "english_definition": "to communicate with, to make someone understand (also: to break through to)",
                "persian_definition_meaning": "با کسی ارتباط برقرار کردن، کسی را متوجه کردن (همچنین: to break through to)",
                "english_explanation": "This idiom has the meaning of to make someone \"catch on\" (Lesson 29, eighth idiom, the first definition)",
                "persian_explanation_meaning": "این اصطلاح به معنای 'make someone \"catch on\"' (درس 29، اصطلاح هشتم، تعریف اول) است."
                ,
                "examples": [
                  {
                    "english_text": "Some of the students in my reading class understand English so poorly that it is difficult to get through to them.",
                    "persian_meaning": "برخی از دانش‌آموزان در کلاس خواندن من انگلیسی را آنقدر ضعیف می‌فهمند که برقراری ارتباط با آنها دشوار است."
                  },
                  {
                    "english_text": "The doctors have never succeeded in breaking through to Mr. Ames, who is a silent and secretive patient.",
                    "persian_meaning": "پزشکان هرگز نتوانسته‌اند با آقای ایمز، که بیماری ساکت و مرموز است، ارتباط برقرار کنند."
                  }
                ]
              },
              {
                "english_phrase": "to keep one's word",
                "persian_phrase_meaning": "به قول خود عمل کردن",
                "english_definition": "to fulfill a promise, to be responsible",
                "persian_definition_meaning": "به وعده‌ای عمل کردن، مسئولیت‌پذیر بودن",
                "english_explanation": "An idiom with the opposite meaning is to break one's word.",
                "persian_explanation_meaning": "اصطلاحی با معنی مخالف 'to break one's word' است."
                ,
                "examples": [
                  {
                    "english_text": "Suzanne kept her word to me not to let on to others that I intend to step down next month.",
                    "persian_meaning": "سوزان به قولش به من عمل کرد که به دیگران فاش نکند که قصد دارم ماه آینده کناره‌گیری کنم."
                  },
                  {
                    "english_text": "Thomas always intends to keep his word, but invariably the end result is that he breaks his word. He just isn't capable of being a responsible person.",
                    "persian_meaning": "توماس همیشه قصد دارد به قولش عمل کند، اما نتیجه نهایی این است که همیشه زیر قولش می‌زند. او فقط قادر به مسئولیت‌پذیری نیست."
                  }
                ]
              },
              {
                "english_phrase": "to be over one's head",
                "persian_phrase_meaning": "بسیار مشغول بودن، سرش شلوغ بودن؛ فراتر از توانایی درک کسی بودن",
                "english_definition": "to be very busy, to have too much to do (also: to be up to one's ears); to be beyond one's ability to understand",
                "persian_definition_meaning": "بسیار مشغول بودن، کارهای زیادی برای انجام دادن داشتن (همچنین: to be up to one's ears)؛ فراتر از توانایی درک کسی بودن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "I'd love to take a week off for a hiking trip, but at the moment I am over my head in work. Maybe next week when I'm only up to my ears!",
                    "persian_meaning": "دوست دارم یک هفته برای یک سفر کوهنوردی مرخصی بگیرم، اما در حال حاضر سرم از کار شلوغ است. شاید هفته آینده که فقط تا خرخره درگیر کار هستم!"
                  },
                  {
                    "english_text": "It was impossible for the tutor to get through to Bill about the physics problem because the subject matter was over Bill's head.",
                    "persian_meaning": "برای معلم خصوصی غیرممکن بود که مشکل فیزیک را به بیل بفهماند زیرا موضوع فراتر از درک بیل بود."
                  }
                ]
              },
              {
                "english_phrase": "to ask for",
                "persian_phrase_meaning": "مستحق بودن، مجازات عادلانه دریافت کردن",
                "english_definition": "to deserve, to receive a just punishment (also: to bring upon)",
                "persian_definition_meaning": "شایسته بودن، مجازات عادلانه دریافت کردن (همچنین: to bring upon)",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "If you drink alcohol and then drive a car, you're only asking for trouble.",
                    "persian_meaning": "اگر الکل بنوشید و سپس رانندگی کنید، فقط دنبال دردسر هستید."
                  },
                  {
                    "english_text": "Don't complain about your cut in salary. You asked for it by refusing to heed our repeated warnings not to be late and inefficient.",
                    "persian_meaning": "از کاهش حقوق خود شکایت نکنید. شما با نادیده گرفتن هشدارهای مکرر ما در مورد دیر نکردن و ناکارآمدی، خودتان خواستید."
                  }
                ]
              },
              {
                "english_phrase": "to be a far cry from",
                "persian_phrase_meaning": "بسیار متفاوت بودن از",
                "english_definition": "to be very different from",
                "persian_definition_meaning": "بسیار متفاوت بودن از چیزی",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "I enjoyed visiting Seattle, but it was a far cry from the ideal vacation spot I expected.",
                    "persian_meaning": "از بازدید سیاتل لذت بردم، اما با مکان ایده‌آل تعطیلاتی که انتظار داشتم، بسیار متفاوت بود."
                  },
                  {
                    "english_text": "Ned is enjoying his new job, but his responsibilities are a far cry from what he was told they would be.",
                    "persian_meaning": "ند از شغل جدیدش لذت می‌برد، اما مسئولیت‌هایش با آنچه به او گفته شده بود، بسیار متفاوت است."
                  }
                ]
              },
              {
                "english_phrase": "by all means",
                "persian_phrase_meaning": "حتماً، قطعاً؛ با هر وسیله ممکن",
                "english_definition": "certainly, definitely, naturally (also: of course); using any possible way or method",
                "persian_definition_meaning": "قطعاً، به طور طبیعی (همچنین: of course)؛ با استفاده از هر روش یا وسیله ممکن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "If the Johnsons invite us for dinner, then by all means we have to return the invitation. Of course, we don't have to invite their children, too.",
                    "persian_meaning": "اگر خانواده جانسون ما را به شام دعوت کنند، قطعاً باید دعوت را پس بدهیم. البته لازم نیست بچه‌هایشان را هم دعوت کنیم."
                  },
                  {
                    "english_text": "In order to ensure its survival, the ailing company has to obtain an infusion of cash by all means.",
                    "persian_meaning": "برای تضمین بقای خود، شرکت در حال احتضار باید به هر وسیله ممکن، تزریق پول نقد را به دست آورد."
                  }
                ]
              },
              {
                "english_phrase": "to get out from under",
                "persian_phrase_meaning": "امنیت مالی خود را بازگرداندن، از زیر بار مالی خارج شدن",
                "english_definition": "to restore one's financial security, to resolve a difficult financial obligation",
                "persian_definition_meaning": "امنیت مالی خود را بازگرداندن، یک تعهد مالی دشوار را حل کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "After years of struggling to get ahead, the young couple finally got out from under their debts.",
                    "persian_meaning": "پس از سال‌ها تلاش برای پیشرفت، زوج جوان بالاخره از زیر بار بدهی‌هایشان خارج شدند."
                  },
                  {
                    "english_text": "The ailing company, succeeding in obtaining the necessary cash, was able to get out from under its financial burdens.",
                    "persian_meaning": "شرکت در حال احتضار، با موفقیت در به دست آوردن پول نقد لازم، توانست از زیر بار مالی خود خارج شود."
                  }
                ]
              },
              {
                "english_phrase": "to take the bull by the horns",
                "persian_phrase_meaning": "با عزم راسخ با موقعیت دشوار مقابله کردن",
                "english_definition": "to handle a difficult situation with determination",
                "persian_definition_meaning": "با عزم راسخ با یک موقعیت دشوار مقابله کردن",
                "english_explanation": "This idiom is usually used when someone has been postponing an action for some time and finally wants or needs to resolve it.",
                "persian_explanation_meaning": "این اصطلاح معمولاً زمانی استفاده می‌شود که کسی مدتی اقدامی را به تعویق انداخته و بالاخره می‌خواهد یا نیاز دارد آن را حل کند."
                ,
                "examples": [
                  {
                    "english_text": "After three years of faithful service, Jake decided to take the bull by the horns and ask his boss for a raise.",
                    "persian_meaning": "پس از سه سال خدمت وفادارانه، جیک تصمیم گرفت با عزم راسخ از رئیسش درخواست افزایش حقوق کند."
                  },
                  {
                    "english_text": "Vic has been engaged to Laura for a long time now, and I know that he loves her. He should take the bull by the horns and ask her to marry him.",
                    "persian_meaning": "ویک مدت زیادی است که با لورا نامزد کرده است و می‌دانم که او را دوست دارد. او باید با عزم راسخ از او خواستگاری کند."
                  }
                ]
              },
              {
                "english_phrase": "to give (someone) a hand",
                "persian_phrase_meaning": "کمک کردن، یاری رساندن",
                "english_definition": "to assist, to aid, to help (also: to lend someone a hand) (S)",
                "persian_definition_meaning": "کمک کردن، یاری رساندن (همچنین: to lend someone a hand)",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Would you give me a hand lifting this heavy box?",
                    "persian_meaning": "می‌توانید در بلند کردن این جعبه سنگین به من کمک کنید؟"
                  },
                  {
                    "english_text": "When Terry's car broke down at night on the highway, no one would stop to lend her a hand.",
                    "persian_meaning": "وقتی ماشین تری شب در بزرگراه خراب شد، هیچ کس توقف نکرد تا به او کمک کند."
                  }
                ]
              },
              {
                "english_phrase": "to give (someone) a big hand",
                "persian_phrase_meaning": "دست زدن (به نشانه تشویق)",
                "english_definition": "to clap one's hands in applause, to applaud (S)",
                "persian_definition_meaning": "دست زدن به نشانه تشویق، تشویق کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "After the talented new vocalist had sung her number, the audience gave her a big hand.",
                    "persian_meaning": "پس از اینکه خواننده جدید و با استعداد آهنگش را خواند، تماشاگران او را به شدت تشویق کردند."
                  },
                  {
                    "english_text": "Should we give a big hand to each beauty contestant as she is introduced, or should we wait until all the introductions are finished?",
                    "persian_meaning": "آیا باید به هر شرکت‌کننده مسابقه زیبایی هنگام معرفی شدنش دست بزنیم، یا باید صبر کنیم تا تمام معرفی‌ها به پایان برسد؟"
                  }
                ]
              }
            ]
          },
          {
            "lesson_number": 39,
            "lesson_name": "LESSON 39",
            "persian_lesson_name": "درس 39",
            "idioms": [
              {
                "english_phrase": "to goof off",
                "persian_phrase_meaning": "وقت تلف کردن، بیکار بودن",
                "english_definition": "to waste time, to be idle",
                "persian_definition_meaning": "وقت تلف کردن، بیکار بودن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Some of the workers in our office always goof off when the boss is out.",
                    "persian_meaning": "بعضی از کارگران در دفتر ما همیشه وقتی رئیس نیست، وقت تلف می‌کنند."
                  },
                  {
                    "english_text": "On Saturday afternoons, I like to go to a movie or just goof off at home.",
                    "persian_meaning": "عصرهای شنبه، دوست دارم به سینما بروم یا فقط در خانه بیکار باشم."
                  }
                ]
              },
              {
                "english_phrase": "to talk back to",
                "persian_phrase_meaning": "با بی‌احترامی پاسخ دادن، گستاخی کردن",
                "english_definition": "to answer in a rude manner, to speak to disrespectfully",
                "persian_definition_meaning": "به شیوه‌ای بی‌ادبانه پاسخ دادن، با بی‌احترامی صحبت کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Billy, if you talk back to me like that once more, you're going to spend the rest of the day in your room.",
                    "persian_meaning": "بیلی، اگر یک بار دیگر اینطور با من گستاخی کنی، بقیه روز را در اتاقت خواهی گذراند."
                  },
                  {
                    "english_text": "The school principal had to reprimand the child for talking back to her teacher.",
                    "persian_meaning": "مدیر مدرسه مجبور شد کودک را به دلیل گستاخی به معلمش توبیخ کند."
                  }
                ]
              },
              {
                "english_phrase": "to be in",
                "persian_phrase_meaning": "محبوب یا مد روز بودن؛ در دسترس بودن",
                "english_definition": "to be popular or fashionable; to be available at one's work or home",
                "persian_definition_meaning": "محبوب یا مد روز بودن؛ در محل کار یا خانه در دسترس بودن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Most young people tend to want anything that is in at the time, but a few don't care about current trends.",
                    "persian_meaning": "بیشتر جوانان تمایل دارند هر چیزی که در آن زمان مد است را بخواهند، اما برخی به روندهای کنونی اهمیت نمی‌دهند."
                  },
                  {
                    "english_text": "Could you please tell me when Mrs. Zachary will be in? I'd like to talk to her soon.",
                    "persian_meaning": "لطفاً می‌توانید به من بگویید خانم زاکاری کی در دسترس هستند؟ می‌خواهم به زودی با او صحبت کنم."
                  }
                ]
              },
              {
                "english_phrase": "to be out",
                "persian_phrase_meaning": "غیرمحبوب یا از مد افتاده بودن؛ غایب بودن",
                "english_definition": "to be unpopular or no longer in fashion; to be away from one's work or home",
                "persian_definition_meaning": "غیرمحبوب یا دیگر مد نبودن؛ از محل کار یا خانه دور بودن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "These days, designer jeans are in and long skirts are out.",
                    "persian_meaning": "این روزها، شلوارهای جین طراح مد هستند و دامن‌های بلند از مد افتاده‌اند."
                  },
                  {
                    "english_text": "I'm sorry, Mr. Jensen is out at the moment. Could I take a message?",
                    "persian_meaning": "متأسفم، آقای جنسن در حال حاضر بیرون هستند. می‌توانم پیامی بگیرم؟"
                  }
                ]
              },
              {
                "english_phrase": "to draw the line at",
                "persian_phrase_meaning": "خط قرمز تعیین کردن، غیرقابل قبول دانستن",
                "english_definition": "to determine to be unacceptable, to refuse to consider",
                "persian_definition_meaning": "غیرقابل قبول دانستن، از بررسی کردن خودداری کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "I don't mind helping him with his homework, but I draw the line at writing a term paper for him.",
                    "persian_meaning": "کمک کردن به او در تکالیفش برایم مشکلی ندارد، اما برای نوشتن یک مقاله پایان‌ترم برایش خط قرمز دارم."
                  },
                  {
                    "english_text": "The conference organizers tried to accommodate the needs of the various interest groups, but they drew the line at extending the conference by two days.",
                    "persian_meaning": "برگزارکنندگان کنفرانس سعی کردند نیازهای گروه‌های ذینفع مختلف را برآورده کنند، اما از تمدید کنفرانس به مدت دو روز خودداری کردند."
                  }
                ]
              },
              {
                "english_phrase": "to get out of line",
                "persian_phrase_meaning": "سرپیچی کردن از قواعد یا روال عادی",
                "english_definition": "to disobey or ignore normal procedures or rules (also: to step out of line)",
                "persian_definition_meaning": "نافرمانی کردن یا نادیده گرفتن روال‌ها یا قوانین عادی (همچنین: to step out of line)",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "When a child gets out of line in that teacher's class, she uses the old-fashioned method of making the child sit in the corner of the room.",
                    "persian_meaning": "وقتی بچه‌ای در کلاس آن معلم از حد خود خارج می‌شود، او از روش قدیمی نشاندن کودک در گوشه اتاق استفاده می‌کند."
                  },
                  {
                    "english_text": "Any employee who steps out of line by coming to work in an unacceptable condition will be fired.",
                    "persian_meaning": "هر کارمندی که با آمدن به سر کار در شرایط نامناسب از حد خود خارج شود، اخراج خواهد شد."
                  }
                ]
              },
              {
                "english_phrase": "dry run",
                "persian_phrase_meaning": "تمرین، اجرای آزمایشی",
                "english_definition": "rehearsal, practice session",
                "persian_definition_meaning": "تمرین، جلسه تمرین",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "The college president requested a dry run of the graduation ceremony in order to ensure that all aspects went smoothly.",
                    "persian_meaning": "رئیس کالج درخواست یک تمرین از مراسم فارغ‌التحصیلی را داد تا اطمینان حاصل کند که همه جنبه‌ها به آرامی پیش می‌رود."
                  },
                  {
                    "english_text": "Before the manager presented the reorganizational plans to the board of directors, he did several dry runs of his presentation.",
                    "persian_meaning": "قبل از اینکه مدیر طرح‌های سازماندهی مجدد را به هیئت مدیره ارائه دهد، چندین بار ارائه خود را تمرین کرد."
                  }
                ]
              },
              {
                "english_phrase": "to play by ear",
                "persian_phrase_meaning": "موسیقی را با شنیدن نواختن؛ بدون برنامه قبلی عمل کردن",
                "english_definition": "to play music that one has heard but never read (S); to proceed without plan, to do spontaneously (S)",
                "persian_definition_meaning": "موسیقی را که شنیده اما هرگز نت آن را نخوانده، نواختن؛ بدون برنامه پیش رفتن، به صورت خودجوش عمل کردن",
                "english_explanation": "The pronoun it is often used with the second definition.",
                "persian_explanation_meaning": "ضمیر 'it' اغلب با تعریف دوم استفاده می‌شود."
                ,
                "examples": [
                  {
                    "english_text": "That pianist can play most popular music by ear. She never needs to read sheet music.",
                    "persian_meaning": "آن پیانیست می‌تواند بیشتر موسیقی‌های محبوب را با شنیدن بنوازد. او هرگز نیازی به خواندن نت موسیقی ندارد."
                  },
                  {
                    "english_text": "My husband wanted to plan our trip carefully, but I argued that it was more fun if we played it by ear.",
                    "persian_meaning": "شوهرم می‌خواست سفرمان را با دقت برنامه‌ریزی کند، اما من استدلال کردم که اگر بدون برنامه قبلی پیش برویم، سرگرم‌کننده‌تر خواهد بود."
                  }
                ]
              },
              {
                "english_phrase": "to be in (someone's) shoes",
                "persian_phrase_meaning": "در موقعیت شخص دیگری بودن",
                "english_definition": "to be in another person's position, to face the same situation as another person",
                "persian_definition_meaning": "در موقعیت شخص دیگری بودن، با همان وضعیت شخص دیگری روبرو شدن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "If I were in your shoes, I wouldn't take too many classes this semester.",
                    "persian_meaning": "اگر جای شما بودم، این ترم کلاس‌های زیادی بر نمی‌داشتم."
                  },
                  {
                    "english_text": "When his boss finds out about that accounting error, I wouldn't want to be in his shoes.",
                    "persian_meaning": "وقتی رئیسش در مورد آن خطای حسابداری بفهمد، دلم نمی‌خواهد جای او باشم."
                  }
                ]
              },
              {
                "english_phrase": "to keep after",
                "persian_phrase_meaning": "دائماً یادآوری کردن، غر زدن",
                "english_definition": "to remind constantly, to nag",
                "persian_definition_meaning": "دائماً یادآوری کردن، سرزنش کردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Lynn always has to keep after her children about cleaning up their rooms and doing chores around the house.",
                    "persian_meaning": "لین همیشه باید به فرزندانش در مورد مرتب کردن اتاق‌هایشان و انجام کارهای خانه تذکر دهد."
                  },
                  {
                    "english_text": "Lon is so forgetful that it's necessary to keep after him about every little thing.",
                    "persian_meaning": "لان آنقدر فراموشکار است که لازم است در مورد هر چیز کوچکی به او یادآوری کرد."
                  }
                ]
              },
              {
                "english_phrase": "to fix up",
                "persian_phrase_meaning": "تعمیر یا مرتب کردن؛ قرار ملاقات گذاشتن برای کسی",
                "english_definition": "to repair or put back in good condition (S); to arrange a date or an engagement for another person (S)",
                "persian_definition_meaning": "تعمیر کردن یا به وضعیت خوب برگرداندن؛ قرار ملاقات یا نامزدی برای شخص دیگری ترتیب دادن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "Instead of buying an expensive new home, we decided to buy an older home and fix it up ourselves.",
                    "persian_meaning": "به جای خرید یک خانه جدید گران‌قیمت، تصمیم گرفتیم یک خانه قدیمی بخریم و خودمان آن را تعمیر کنیم."
                  },
                  {
                    "english_text": "Since my visiting friend didn't have a date for dinner, I fixed her up with a male friend of mine. They got along very well together.",
                    "persian_meaning": "از آنجایی که دوست مهمان من برای شام قراری نداشت، او را با یکی از دوستان مرد خودم آشنا کردم. آنها با هم خیلی خوب کنار آمدند."
                  }
                ]
              },
              {
                "english_phrase": "to be had",
                "persian_phrase_meaning": "قربانی شدن، فریب خوردن",
                "english_definition": "to be victimized or cheated",
                "persian_definition_meaning": "قربانی شدن یا فریب خوردن",
                "english_explanation": "",
                "persian_explanation_meaning": "",
                "examples": [
                  {
                    "english_text": "When the jeweler confirmed that the diamonds that the woman had purchased abroad were really fake, she exclaimed, \"I've been had!\"",
                    "persian_meaning": "وقتی جواهرفروش تأیید کرد که الماس‌هایی که زن از خارج خریده بود واقعاً تقلبی هستند، او فریاد زد: «سرم کلاه رفت!»"
                  },
                  {
                    "english_text": "The angry customer complained about being overcharged at the store, asserting that this was the third time that he had been had.",
                    "persian_meaning": "مشتری عصبانی از گرانفروشی در فروشگاه شکایت کرد و ادعا کرد که این سومین باری است که او فریب خورده است."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }